Core/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Физлицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗанятости</name>
    <type>
      <types>EnumRef.ТипыЗанятости</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовСПерсоналом</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовСПодотчетниками</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовПоПерерасходу</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовСПерсоналомРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовСПодотчетникамиРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовПоПерерасходуРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВыдачиНДФЛ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетПоУмолчанию</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияПолучателейДоходов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеНаИностранскомЯзыке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидНачисленияУдержания</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyUserAccountId</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>AzRyJiraUserIDs</name>
    <attributes>
      <name>id</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>70</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/AccumulationRegisters/РасчетыСПерсоналом/РасчетыСПерсоналом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыСПерсоналом</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СодержаниеПроводки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/AccumulationRegisters/РасчетыСПодотчетниками/РасчетыСПодотчетниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыСПодотчетниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СодержаниеПроводки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.РасходСоСчета</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ПоступлениеВКассу</types>
      <types>DocumentRef.Конвертация</types>
      <types>DocumentRef.РасходИзКассы</types>
      <types>DocumentRef.ПоступлениеНаСчет</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/Catalogs/Сотрудники/Forms/ФормаРедактированияСчетовУчета/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Функция проверяет возможность изменения счета.
//
&НаСервере
Функция ОтказИзменитьСчетРасчетовСПерсоналом(Ссылка)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	РасчетыСПерсоналом.Период,
	|	РасчетыСПерсоналом.Регистратор,
	|	РасчетыСПерсоналом.НомерСтроки,
	|	РасчетыСПерсоналом.Активность,
	|	РасчетыСПерсоналом.ВидДвижения,
	|	РасчетыСПерсоналом.Организация,
	|	РасчетыСПерсоналом.СтруктурнаяЕдиница,
	|	РасчетыСПерсоналом.Сотрудник,
	|	РасчетыСПерсоналом.Валюта,
	|	РасчетыСПерсоналом.ПериодРегистрации,
	|	РасчетыСПерсоналом.Сумма,
	|	РасчетыСПерсоналом.СуммаВал,
	|	РасчетыСПерсоналом.СодержаниеПроводки
	|ИЗ
	|	РегистрНакопления.РасчетыСПерсоналом КАК РасчетыСПерсоналом
	|ГДЕ
	|	РасчетыСПерсоналом.Сотрудник = &Сотрудник");
	
	Запрос.УстановитьПараметр("Сотрудник", ?(ЗначениеЗаполнено(Ссылка), Ссылка, Неопределено));
	
	Результат = Запрос.Выполнить();
	
	Возврат НЕ Результат.Пустой();
	
КонецФункции // ОтказИзменитьСчетРасчетовСПерсоналом()

// Функция проверяет возможность изменения счета.
//
&НаСервере
Функция ОтказИзменитьСчетРасчетовСПодотчетниками(Ссылка)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	РасчетыСПодотчетниками.Период,
	|	РасчетыСПодотчетниками.Регистратор,
	|	РасчетыСПодотчетниками.НомерСтроки,
	|	РасчетыСПодотчетниками.Активность,
	|	РасчетыСПодотчетниками.ВидДвижения,
	|	РасчетыСПодотчетниками.Организация,
	|	РасчетыСПодотчетниками.Сотрудник,
	|	РасчетыСПодотчетниками.Валюта,
	|	РасчетыСПодотчетниками.Документ,
	|	РасчетыСПодотчетниками.Сумма,
	|	РасчетыСПодотчетниками.СуммаВал,
	|	РасчетыСПодотчетниками.СодержаниеПроводки
	|ИЗ
	|	РегистрНакопления.РасчетыСПодотчетниками КАК РасчетыСПодотчетниками
	|ГДЕ
	|	РасчетыСПодотчетниками.Сотрудник = &Сотрудник");
	
	Запрос.УстановитьПараметр("Сотрудник", ?(ЗначениеЗаполнено(Ссылка), Ссылка, Неопределено));
	
	Результат = Запрос.Выполнить();
	
	Возврат НЕ Результат.Пустой();
	
КонецФункции // ОтказИзменитьСчетРасчетовСПодотчетниками()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события ПриСозданииНаСервере формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СчетРасчетовСПерсоналом = Параметры.СчетРасчетовСПерсоналом;
	СчетРасчетовСПодотчетниками = Параметры.СчетРасчетовСПодотчетниками;
	СчетРасчетовПоПерерасходу = Параметры.СчетРасчетовПоПерерасходу;
	СчетРасчетовСПерсоналомРегл = Параметры.СчетРасчетовСПерсоналомРегл;
	СчетРасчетовСПодотчетникамиРегл = Параметры.СчетРасчетовСПодотчетникамиРегл;
	СчетРасчетовПоПерерасходуРегл = Параметры.СчетРасчетовПоПерерасходуРегл;
	Ссылка = Параметры.Ссылка;
	
	Если ОтказИзменитьСчетРасчетовСПерсоналом(Ссылка) Тогда
		Элементы.СПерсоналом.Подсказка = НСтр("ka='ბაზაში არის ამ თანამშრომლის თაობაზე მოძრაობები! პერსონალთან ანგარიშსწორების მიხედვით აღრიცხვის ანგარიშების შეცვლა აკრძალულია!';ru='В базе есть движения по этому сотруднику! Изменение счетов учета по расчетам с персоналом запрещено!';en='At the base there is movement on the employee! Change of accounting settlements with personnel is prohibited!'");
		Элементы.СПерсоналом.Доступность = Ложь;
	КонецЕсли;

	Если ОтказИзменитьСчетРасчетовСПодотчетниками(Ссылка) Тогда
		Элементы.СПодотчетником.Подсказка = НСтр("ka='ბაზაში არის ამ ანგარიშვალდებული პირის თაობაზე მოძრაობები! ანგარიშვალდებულებთან ანგარიშსწორებების მიხედვით აღრიცხვის ანგარიშების შეცვლა აკრძალულია!';ru='В базе есть движения по этому подотчетнику! Изменение счетов учета по расчетам с подотчетниками запрещено!';en='At the base there is movement on this podotchetniku! Change of accounting settlements with podotchetnikami forbidden!'");
		Элементы.СПодотчетником.Доступность = Ложь;
	КонецЕсли;
	
	Если НЕ Элементы.СПерсоналом.Доступность
		И НЕ Элементы.СПодотчетником.Доступность Тогда
		Элементы.ПоУмолчанию.Видимость = Ложь;
	КонецЕсли;
	
	РегламентированныйУчетСервер.УстановитьВидимостьУпрУчета(ЭтаФорма);
	
КонецПроцедуры // ПриСозданииНаСервере()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

// Процедура - обработчик нажатия команды ПоУмолчанию.
//
&НаКлиенте
Процедура ПоУмолчанию(Команда)
	
	СчетРасчетовСПерсоналом = ПредопределенноеЗначение("ПланСчетов.Управленческий.ПустаяСсылка");
	СчетРасчетовСПодотчетниками = ПредопределенноеЗначение("ПланСчетов.Управленческий.ПустаяСсылка");
	СчетРасчетовПоПерерасходу = ПредопределенноеЗначение("ПланСчетов.Управленческий.ПустаяСсылка");
	
	СчетРасчетовСПерсоналомРегл = РегламентированныйУчетСервер.ПолучитьСчетПоНомеру("3130");
	СчетРасчетовСПодотчетникамиРегл = РегламентированныйУчетСервер.ПолучитьСчетПоНомеру("1430");
	СчетРасчетовПоПерерасходуРегл = РегламентированныйУчетСервер.ПолучитьСчетПоНомеру("3160");
	
КонецПроцедуры // ПоУмолчанию()

&НаКлиенте
Процедура СчетРасчетовСПерсоналомПриИзменении(Элемент)
	
	//Если НЕ ЗначениеЗаполнено(СчетРасчетовСПерсоналом) Тогда
	//	СчетРасчетовСПерсоналом = ПредопределенноеЗначение("ПланСчетов.Управленческий.РасчетыСПерсоналомПоОплатеТруда");
	//КонецЕсли;
	ОповеститьОбИзмененииСчетовРасчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетРасчетовСПодотчетникамиПриИзменении(Элемент)
	
	//Если НЕ ЗначениеЗаполнено(СчетРасчетовСПодотчетниками) Тогда
	//	СчетРасчетовСПодотчетниками = ПредопределенноеЗначение("ПланСчетов.Управленческий.РасчетыСПодотчетниками");
	//КонецЕсли;
	ОповеститьОбИзмененииСчетовРасчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетРасчетовПоПерерасходуПриИзменении(Элемент)
	
	//Если НЕ ЗначениеЗаполнено(СчетРасчетовПоПерерасходу) Тогда
	//	СчетРасчетовПоПерерасходу = ПредопределенноеЗначение("ПланСчетов.Управленческий.ПерерасходПодотчетников");
	//КонецЕсли;
	ОповеститьОбИзмененииСчетовРасчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОповеститьОбИзмененииСчетовРасчетов()
	
	СтруктураПараметры = Новый Структура(                  
		"СчетРасчетовСПерсоналом, СчетРасчетовСПодотчетниками, СчетРасчетовПоПерерасходу, СчетРасчетовСПерсоналомРегл, СчетРасчетовСПодотчетникамиРегл, СчетРасчетовПоПерерасходуРегл",
		СчетРасчетовСПерсоналом, СчетРасчетовСПодотчетниками, СчетРасчетовПоПерерасходу, СчетРасчетовСПерсоналомРегл, СчетРасчетовСПодотчетникамиРегл, СчетРасчетовПоПерерасходуРегл
	);
	
	Оповестить("ИзменилисьСчетаСотрудники", СтруктураПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетРасчетовСПерсоналомРеглПриИзменении(Элемент)
	ОповеститьОбИзмененииСчетовРасчетов();
КонецПроцедуры

&НаКлиенте
Процедура СчетРасчетовСПодотчетникамиРеглПриИзменении(Элемент)
	ОповеститьОбИзмененииСчетовРасчетов();
КонецПроцедуры

&НаКлиенте
Процедура СчетРасчетовПоПерерасходуРеглПриИзменении(Элемент)
	ОповеститьОбИзмененииСчетовРасчетов();
КонецПроцедуры
